src/Catalogs/ВидыПиломатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ВидыПиломатериалов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПиломатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПиломатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаШирины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаВысоты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыПиломатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыПиломатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Брус</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бревно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыПиломатериалов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область Служебные_Процедуры_И_Функции

// Управление видимостью элементов формы и отображением заголовков элементов управления.
//
&НаСервере
Процедура УправлениеВидимостью()

	// Видимость высоты в зависимости от типа пиломатериала
	//
	ВидимостьВысоты = (Объект.ТипПиломатериала = Перечисления.ТипыПиломатериалов.Доска) ИЛИ Ложь;
	ОбщегоНазначения.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВысота", "Видимость", ВидимостьВысоты);
	
	
	// Изменение заголовка ширины в зависимости от типа пиломатериала
	//
	ЗаголовокШирины = ?(Объект.ТипПиломатериала = Перечисления.ТипыПиломатериалов.Бревно, НСтр("ru='Диаметр'"), НСтр("ru='Ширина'"));
	ОбщегоНазначения.УстановитьСвойствоЭлементаФормы(Элементы, "Ширина", "Заголовок", ЗаголовокШирины);

КонецПроцедуры // УправлениеВидимостью
 

#КонецОбласти



#Область Обработчики_Событий_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация нового элемента
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Настройки = ОбщегоНазначения.СохраняемыеЗначения(ИмяФормы);
		
		// Заполнение единиц измерения
		Объект.ЕдиницаВысоты 	= Константы.ЕдиницаВысоты.Получить();
		Объект.ЕдиницаДлины 	= Константы.ЕдиницаДлины.Получить();
		Объект.ЕдиницаШирины 	= Константы.ЕдиницаШирины.Получить();
		
		// Установление типа пиломатериала
		Если Настройки.Свойство("ТипПиломатериала") Тогда
			Объект.ТипПиломатериала = Настройки.ТипПиломатериала;
		Иначе
			Объект.ТипПиломатериала = Перечисления.ТипыПиломатериалов.Брус;
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры // ПриСозданииНаСервере

#КонецОбласти



#Область Обработчики_Событий_Элементов_Формы

&НаСервере
Процедура ТипПиломатериалаПриИзмененииНаСервере()
	
	ОбщегоНазначения.СохранитьНастройку(ИмяФормы, "ТипПиломатериала", Объект.ТипПиломатериала);
	
	УправлениеВидимостью();
	
КонецПроцедуры // ТипПиломатериалаПриИзмененииНаСервере

&НаКлиенте
Процедура ТипПиломатериалаПриИзменении(Элемент)
	ТипПиломатериалаПриИзмененииНаСервере();
КонецПроцедуры // ТипПиломатериалаПриИзменении

#КонецОбласти
